Repository: translate/mozilla-com
Catalog: ach/plugincheck/content.inc.html.po
Languages: lg

source: Check Your <span>Plugins</span>
lg: Rot mamemgi<span>Plugins</span>

source: Keeping your third-party plugins up to date helps Firefox run safely and smoothly.
lg: Gwoko rwak iyie ni me adek iyie wek obed matiyo konyo Firefox tiyo mamwonya kede dang dok mapwot olu.

source: Missing <span>FLASH?</span>
lg: Orem <span>FLASH?</span>

source: For your safety, Firefox has disabled your outdated version of Flash. Please <a mozhack="<?=$link[0];?>" >upgrade to the latest version.</a>
lg: Pi ber bedo ni, Firefox otyeko jwiko woko cik mamegi ma kare ne okato woko pi Flash. Tim ber <a mozhack="<?=$link[0];?>" > wek iyil rwome malu pi cik mere manyen.</a>

source: <strong>Warning, a newer version of your browser is available.</strong> Please upgrade your browser.
lg: <strong>Ciko, cik manyen meri me layab mamegi bene dong atye.</tek odoco> Tim ber iyil rwom me layab meri malu.

source: This page works best with the latest browsers: Firefox 3.6+, Opera 10.5+, Safari 4+, Chrome 4+, or IE 8+
lg: Pot buk ma eni tiyo maber ki layeny web mukati manyen: Firefox 3.6+, Opera 10.5+, Safari 4+, Chrome 4+, or IE 8+

source: Plugin Check <strong>support for Internet Explorer is limited</strong>. Also use Tools &gt; Manage Addons
lg: Roto rwako iyie <strong> cwak me Internet Explorer pe nok/strong>.Amanono dang tiyo ki Gin tic &gt; Loyo odoco Med ikome

source: <strong><em>Step 1:</em></strong> Click <strong>Update</strong> to update a plugin.
lg: <strong><em>rwom 1:</em></strong> dii <strong>Update</strong> wek ket rwak iyie.

source: <strong><em>Step 2:</em></strong> <strong>Complete all recommended updates</strong> <em>before</em> restarting your browser.
lg: <strong><em>rwom 2:</em></strong> <strong> Tyek moka weng me keto gin manyen strong> <em>mapwod pe</em> ocako odoco layab web mamegi.

source: Note
lg: Ngec

source: <strong>You have JavaScript disabled</strong> or are using a browser without JavaScript. This Plugin Check page does not work without the awesome power of <strong>JavaScript</strong>. Please enable this Content Preference and reload the page.
lg: <strong>Itye ki JavaScript kikwanyo woko</strong> onyo tic ki layab web labongo JavaScript. Rwako iyie ma eni roto pot buk pe tiyo labongo teko mamwonya pi <strong>JavaScript</strong>.Tim ber iyeyi jami ma imito kede opang odoco pot buk.

source: Or disable all your plugins and keep JavaScript disabled... you'd be in good company, that's how <a mozhack="<?=$link[1];?>" >RMS rolls</a>.
lg: Onyo kwany woko rwako iyie weng cite gwok JavaScript kikwanyo woko... yin onwongo myero ibed i kampuni maber atika, man en kit ame myero <a mozhack="<?=$link[1];?>" >RMS loro</a>.

source: Plugin Finding Service Error
lg: Bal me yenyo tic me rwako iyie

source: We've encountered an error. Please try your request again later.
lg: Wabedo ki bal mo. Tim ber item lega mamegi dok lacen.

source: Plugin Tips
lg: Diro me Rwako iyie

# mozilla.com-source/plugincheck/content.inc.html div.div.div.ul.li:67
source: What is a plugin?
lg: Rwak iyie en gin ango?

# mozilla.com-source/plugincheck/content.inc.html div.div.div.ul.li:68
source: Why should I update my plugins?
lg: Pingo kara an myero aket rwak iyie na manyen?

# mozilla.com-source/plugincheck/content.inc.html div.div.div.ul.li:69
source: How can Firefox help me?
lg: Firefox twero konya iyore mene?

# mozilla.com-source/plugincheck/content.inc.html div.div.div.ul.li:70
source: Which plugins do I have?
lg: Rwak iyie mene ma an atye kwede?

# mozilla.com-source/plugincheck/content.inc.html div.div.div.ul.li:71
source: How do I disable a plugin?
lg: Akwany rwak iyie nining?

source: Need Help?
lg: Mito Kony?

source: Visit support.mozilla.org
lg: Lim support.mozilla.org

source: Read support articles about plugins
lg: Kwan cik me cwako te ikom rwak iyie

source: Frequently asked <span>Questions</span>
lg: Maro penyo jwijwi <span>Lapeny</span>

# mozilla.com-source/plugincheck/content.inc.html div.div.div.h3:91
source: What is a plugin?
lg: Rwak iyie obedo gin ango?

source: Plugins power <strong>videos, animation and games</strong>.
lg: Teko me rwako iyie <strong>video, miyo wot ki tuku mapatpat</strong>.

source: They're built <strong>outside of Firefox by companies</strong> like <a mozhack="<?=$link[9];?>">Adobe Systems</a> and <a mozhack="<?=$link[10];?>" >Apple</a>.
lg: Gin gityeko gero <strong>ki woko me Firefox ki kampunu mapol</strong> calo <a mozhack="<?=$link[9];?>">Adobe Systems</a> ki <a mozhack="<?=$link[10];?>" >Apple</a>.

source: Plugins <strong>don't always update</strong> automatically.
lg: Rwak iyie <strong> pe iket gin manyen jwijwi</strong> pire kene.

# mozilla.com-source/plugincheck/content.inc.html div.div.div.h3:98
source: Why should I update my plugins?
lg: Pingo myero aket rwak iyie mamega?

source: Old plugins can interrupt browsing and <strong>waste your time</strong>.
lg: rwak iyie mutii twero nyweno yabo ki <strong>balo kare ni</strong>.

source: Old plugins <strong>increase your risk</strong> for attack by malware, viruses, and other security threats.
lg: Rwak iyie muti <strong>medo bedo pi piri yin</strong> pi mony ki malware, kwidi kompiuta, ki kit balo ber bedo mukene.

source: <strong>Updated plugins have improvements</strong> that make the web <strong>better and safer</strong> for you.
lg: <strong>rwak iyie Ma rwom ne kiyilo malu tye dong maber</strong> mamiyo web <strong>mamwonya kede gwoke maber</strong> piri yin.

# mozilla.com-source/plugincheck/content.inc.html div.div.div.h3:110
source: How can Firefox help me?
lg: Firefox twero konya ningo?

source: In the future, Firefox will update plugins for you. Until then, you should <strong>regularly check this page</strong> and update your plugins to stay safe.
lg: I kare me anyim, Firefox biketo rwak iyie mukene pi yin. Manaka con, myero i <strong>rot pot buk ma eni kare lung</strong> ki ket rwak iyie wek gwoke maber.

# mozilla.com-source/plugincheck/content.inc.html div.div.div.h3:113
source: Which plugins do I have?
lg: Myero ati ki rwak iyie mene?

source: We automatically detected your plugins above, to <strong>view your installed plugins in Firefox</strong> follow these steps:
lg: Wan dong otyeko nwongo rwak iyie mamegi iwie malu, pi <strong>neno odoco rwak iyie mamegi ma in iketo iyi Firefox</strong> lub yadi magi:

# mozilla.com-source/plugincheck/content.inc.html div.div.div.ol.li:116
source: Open the <kbd>Tools</kbd> menu.
lg: Yab <kbd>Gin tic</kbd> nying jami.

# mozilla.com-source/plugincheck/content.inc.html div.div.div.ol.li:117
source: Choose <kbd>Add-ons</kbd>.
lg: Yer <kbd>Med-ikom</kbd>.

# mozilla.com-source/plugincheck/content.inc.html div.div.div.ol.li:118
source: Click the <kbd>plugins</kbd> tab.
lg: Dii <kbd>plugins</kbd> dirica maditi.

# mozilla.com-source/plugincheck/content.inc.html div.div.div.div.h3:122
source: How do I disable a plugin?
lg: Myero akwany rwak iyie ningo?

source: In Firefox:
lg: Iyi Firefox:

# mozilla.com-source/plugincheck/content.inc.html div.div.div.div.ol.li:125
source: Open the <kbd>Tools</kbd> menu.
lg: Yab <kbd>Gin tic</kbd> nying jami.

# mozilla.com-source/plugincheck/content.inc.html div.div.div.div.ol.li:126
source: Choose <kbd>Add-ons</kbd>.
lg: Yer <kbd>Med-ikome</kbd>.

# mozilla.com-source/plugincheck/content.inc.html div.div.div.div.ol.li:127
source: Click the <kbd>plugins</kbd> tab.
lg: Dii <kbd>plugins</kbd> dirica matidi.

source: Click on a plugin in the list.
lg: Dii kom rwak iyie iyi nying jami.

source: Click the <kbd>Disable</kbd> button.
lg: Dii <kbd>Kwany</kbd> mapeca.

source: <strong>Caution:</strong> disabling a plugin means that you will <strong>no longer be able to do</strong> certain things. For example, if you disable Flash, you will not be able to watch videos on popular video streaming sites.
lg: strong> Cung kong:</strong> kwanyo woko rwak iyie nyutu atir ni yin <strong>pe ibi timo</strong> jami mogo. Aporere, ka ce in ikwanyo Flash, Pe ibineno video ikom dyer bar me video mangeye.

source: Have more <span>questions?</span>
lg: Tye mapol <span>lapeny?</span>

source: <a mozhack="<?=$link[7];?>">Our support site</a> can help you <a mozhack="<?=$link[6];?>">learn about plugins</a> or <a mozhack="<?=$link[8];?>">troubleshoot plugin problems</a>.
lg: <a mozhack="<?=$link[7];?>">dyer bar wa me cwako ter</a> twero konyi <a mozhack="<?=$link[6];?>">nwong ngec ikom rwak iyie</a> or <a mozhack="<?=$link[8];?>">kwed bal me peko me rwak iyie</a>.
