Repository: translate/mozilla-com
Catalog: ach/plugincheck/index.html.po
Languages: lg

source: Plugin Check
lg: Roto rwak iyie

source: Plugin details
lg: lok yore kiyore pi rwak iyie

source: State
lg: Kit matye kwede

source: Action
lg: Keto itic

source: Checking with Mozilla on the status of your plugins
lg: Roto kwede Mozilla ikom kit me rwak iyie mamegi

source: Loading Data
lg: Keto Tic

source: View All Your Plugins
lg: Nen rwak iyie weng mamegi

source: Disable Now
lg: Kwany Kombedi

source: Vulnerable No Fix
lg: Peko keken Pe Kiyubu

# $message[5]
source: Update Now
lg: Ket mukene Kombedi

source: Vulnerable
lg: Peko

# $message[7]
source: Update
lg: Ket ngec

source: Outdated Version
lg: Cik ma kare ne okato woko

source: Up to Date
lg: Tye katic naka wa tin

source: Research
lg: Yenyo odoco

source: Unknown plugin
lg: Rwak iyie ma pe ngeye

source: Out of date plugins:
lg: Rwak iyie ma kare ne okato woko:

source: Vulnerable plugins:
lg: Rwak iyie ma peko odiyo:

source: Potentially vulnerable plugins:
lg: Rwak iyie ma peko odiyo a tika:

source: The plugins listed below are up to date
lg: Rwak iyie ma kirweno ne piny kanyi pwod tye katic naka wa tin

source: No plugins were detected
lg: Pe kinwongo rwak iyie

source: current version plugin
lg: Cik me rwak iyie matye

# $message[20]
source: Update Now
lg: Ket mukene Kombedi

source: Potentially Vulnerable
lg: Peko otyeko diyo matek ateka

# $message[22]
source: Update
lg: Ket mukene

source: Potentially Outdated Version
lg: Cik ma kare ne otyeko kato woko

source: <p>This plugin version has a security vulnerability that websites can exploit and potentially harm your computer. It is recommended that you update this plugin or if an update is not available, <a href='#howto-disable'>disable it</a>.</p><p>For more information, read the <a href='#' class='vulner-url'>plugin vendor's vulnerability information</a>.</p><p><a class='qtip-closer'>Close</a></p>
lg: <p>Cik me rwak iyie ma eni tye ki goro me ber bedo ma dyer bar me web romo diyo ki tic matek cite balo kompiuta mamegi. Kimoko ada ni myero iket ngec me rwak iyie ma eni onyo ka ce ngec peke, <a href='#howto-disable'>kwany ne woko</a>.</p><p> Pi ngec mogo mapol, kwan <a href='#' class='vulner-url'>ngec me lucat me rwak iyie</a>.</p><p><a class='qtip-closer'>Lor</a></p>
