Repository: translate/mozilla-com
Catalog: nso/includes/l10n/main.po
Languages: nso

source: Navigation
nso: Tshepelatshepelo

source: Press area
nso: Gatelela lefelo

source: About
nso: Ka ga

source: Store
nso: Boloka

source: Donate
nso: Neela

source: Support
nso: Thekgo

source: Products
nso: Ditšweletšwa

source: Add-ons
nso: Ditlaleletši

source: About Us
nso: Ka ga rena

source: Developers
nso: Batšweletši

source: Labs
nso: Dilaboratori

source: skip to Navigation
nso: tabogela go Tshepelatshepelo

source: switch language
nso: fetoša leleme

source: Back to home page
nso: Morago letlakaleng la gae

source: About Mozilla
nso: Ka ga Mozilla

source: Get Involved
nso: Tsenya letsogo

source: Partnerships
nso: Ditirišano

source: Licensing
nso: Dilaesense

source: Careers
nso: Mešomo

source: Press Center
nso: Lefelo la ditaba

source: Contact Us
nso: Ikgokaganye le rena

source: Site contact
nso: Yo go ka ikgokaganywago le yena saeteng

source: Other languages:
nso: Maleme a mangwe:

source: All rights reserved.
nso: Ditokelo tšohle di bolokilwe.

source: Legal Notices
nso: Ditemošo tša semolao

source: Privacy Policy
nso: Pholisi ya bosephiri

source: Visit Mozilla.com
nso: Etela Mozilla.com

source: Visit Mozilla.com (in English)
nso: Etela Mozilla.com (ka Seisemane)

source: Download Firefox - Free
nso: Laolla Firefox - Mahala

source: Release Notes
nso: Dintlha tša tokollo

source: Other Systems and Languages
nso: Ditshepedišo tše dingwe le maleme

source: Get Firefox
nso: Hwetša Firefox

source: Get Firefox 3
nso: Hwetša Firefox 3

source: Get Firefox 3.5
nso: Hwetša Firefox 3.5

source: Free Download
nso: Go laolla ga mahala

source: Help us make Firefox even better!
nso: Re thuše go dira gore Firefox e be kaone le go feta!

source: Take a few moments to take a quick survey and share your thoughts with us.
nso: Tšea nako e nyenyane gore o tlatše nyakišišo ya kapejana gomme o abelane dikgopolo tša gago le rena.

source: This video brought to you by <a href="%s">Dailymotion</a>, proud supporters of open video.
nso: Bidio ye e tlišitšwe go wena ke <a href="%s">Dailymotion</a>, bathekgi bao ba ikgantšhago ba bidio ya bolokologi.

source: Close
nso: Tswalela

source: (in English)
nso: (ka Seisemane)

source: Download Now - Free
nso: Laolla gona bjale - Mahala

source: Return to top
nso: Boela godimo

source: You should <a href="http://get.adobe.com/flashplayer/">update Adobe Flash Player</a> right now.
nso: O swanetše go <a href="http://get.adobe.com/flashplayer/">mpshafatša Adobe Flash Player</a> gona bjale.

source: Firefox is up to date, but your current version of Flash Player can cause security and stability issues. Please <a href="http://get.adobe.com/flashplayer/">install the free update</a> as soon as possible.
nso: Firefox e mpshafaditšwe, eupša tokollo ya gago ya gona bjale ya Flash Player e ka baka mathata a tšhireletšego le go tia. Hle <a href="http://get.adobe.com/flashplayer/">lokela mpshafatšo ya mahala</a> kapejana ka mo go kgonegago.

source: Features
nso: Dibopego

source: Customize
nso: Tlwaelanya

source: Synchronize
nso: Nyalantšha

source: Develop for Mobile
nso: Tšweletša bakeng sa go thetha

source: Other Supported Platforms
nso: Dipolatefomo tše dingwe tše thekgwago

source: Other Platforms &amp; Languages
nso: Dipolatefomo tše dingwe &amp; Maleme

source: Choose your location
nso: Kgetha lefelo la gago

source: Send the download link to your phone
nso: Romela lomaganyo ya go laolla mogaleng wa gago

source: We could not send a text message to you. Please make sure your number includes a country code (e.g. +1 555-123-4567) and that you answered the captcha correctly.
nso: Re ka romela molaetša wa go ngwalwa go wena. Hle netefatša gore nomoro ya gago e akaretša khoutu ya naga (mohl. +1 555-123-4567) le gore o arabile teko ka mo go nepagetšego.

source: Enter your mobile number and get a text containing a link to download Firefox to your phone.
nso: Tsenya nomoro ya gago ya mogala gomme o hwetše sengwalwa seo se nago le lomaganyo ya go laolla Firefox mogaleng wa gago.

source: Get it now on the Nokia N900
nso: E hwetše gona bjale go Nokia N900

source: Send Text
nso: Romela sengwalwa

source: Standard text rates apply
nso: Go lefišwa ditefo tša motheo tša sengwalwa

source: Download Firefox directly from your phone
nso: Laolla Firefox ka go lebanya go tšwa mogaleng wa gago

source: Download
nso: Laolla

source: Next
nso: Latelago

source: MegaBytes
nso: Dimekapaete

source: FAQ
nso: Dipotšišo tša Kgafetša

source: Videos
nso: Dibidio

source: Except where otherwise <a href="%s">noted</a>, content on this site is licensed under the <br /><a href="%s">Creative Commons Attribution Share-Alike License v3.0</a> or any later version.
nso: Ka ntle le moo go <a href="%s">lemošitšwego</a>, diteng tša saete ye di na le laesense ka tlase ga <br /><a href="%s">Creative Commons Attribution Share-Alike License v3.0</a> goba tokollo e nngwe ya morago bjale.

source: Report Trademark Abuse
nso: Bega tirišompe ya leswaothekišo

source: Free Upgrade
nso: Kaonafatšo ya mahala

source: Follow us on:
nso: Re latelele go:

source: Customize with Add-ons
nso: Tlwaelanya ka ditlaleletši

source: Sync Your Desktop & Mobile
nso: Nyalantšha tesekethopo & sellathekeng sa gago

source: New: Crash Protection
nso: E mpsha: Tšhireletšo ya go pšhatlega

source: Continue browsing even when your video or game crashes.
nso: Tšwela pele o praosa gaešita le ge bidio ya gago goba papadi e pšhatlega.

source: Learn More
nso: Ithute ka mo go oketšegilego

source: Watch the video
nso: Lebelela bidio

source: WebM format
nso: Fomate ya WebM

source: Ogg Theora format
nso: Fomate ya Ogg Theora

source: MPEG-4 format
nso: Fomate ya MPEG-4

source: Whoops! Be sure to enter a valid email address.
nso: O!O! Netefatša go tsenya aterese ya imeile yeo e šomago.

source: Please read the Mozilla Privacy Policy and agree by checking the box.
nso: Hle bala pholisi ya bosephiri ya Mozilla gomme o dumele ka go swaya lepokisi.

source: Please enter your email address and review the Mozilla Privacy Policy.
nso: Hle tsenya aterese ya gago ya imeile gomme o boeletše pholisi ya bosephiri ya Mozilla.

source: Mobile
nso: Sellathekeng

source: Firefox Updated
nso: Firefox e mpshafaditšwe

source: Take a Look at Tomorrow's Web
nso: Lebelela wepe ya gosasa

source: Journey to the Future with Firefox&nbsp;4
nso: Leeto la go ya bokamosong le Firefox&nbsp;4

source: Join the Beta Program
nso: Tsenela lenaneo la Beta

source: Experience Firefox&nbsp;4
nso: Itemogele Firefox&nbsp;4

source: The future of the Web is waiting for you!
nso: Bokamoso bja wepe bo go letetše!

source: The future of the Web starts now.
nso: Bokamoso bja wepe bo thoma gona bjale.

source: Try Firefox with a fresh look and feel.
nso: Leka Firefox yeo e nago le ponagalo le maikutlo a foreše.

source: Experience tomorrow's Web today.
nso: Itemogele wepe ya gosasa lehono.

source: Check out the new look and feel of Firefox&nbsp;4.
nso: Bona ponagalo le maikutlo a maswa a Firefox&nbsp;4.

source: Browse the future of the Web.
nso: Praosa bokamoso bja wepe.

source: See Firefox&nbsp;4 with a new look and feel.
nso: Bona Firefox&nbsp;4 yeo e nago le ponagalo le maikutlo a maswa.

source: Download Beta Now.
nso: Laolla Beta gona bjale.
