Repository: translate/mozilla-com
Catalog: nso/includes/l10n/sub-fx4-firstrun-beta.po
Languages: nso

source: As an open source project and community, we need your feedback to make the next generation browser.
nso: BJalo ka projeke yeo e bulegetšego bohle le ya setšhaba, re hloka karabelo ya gago gore re dire praosara ya moloko o sa tlago.

source: Meet some of the team that has been hard at work on the Firefox 4 project.
nso: Kopana le ba bangwe ba sehlopha bao ba bego ba šoma ka thata projekeng ya Firefox 4.

source: I work on Web Standards like HTML 5, File APIs and IndexedDB.
nso: Ke šoma go metheo ya wepe e bjalo ka HTML 5, File APIs le IndexedDB.

source: We're going to make the best and most secure browser out there!
nso: Re tlile go dira praosara e di phalago ka moka le e šireletšegilego kudu!

source: We work on testing Firefox 4 beta. We'd like to know what you think, we'd like your feedback.
nso: Re leka Firefox 4 beta. Re tla rata go tseba gore o nagana eng, re ka rata karabelo ya gago.

source: You're going to notice a feedback button on the upper-right corner of your browser…
nso: O tla bona konotswana ya karabelo sekhutlwaneng sa godimo-go la go ja la praosara ya gago...

source: …that you can use to tell us what you like and don't like about Firefox 4.
nso: ...yeo o ka e dirišago go re botša ka seo o se ratago le seo o sa se ratego ka Firefox 4.

source: Let me know what you think.
nso: Mpotše gore o nagana eng.

source: Im working on the Firefox 4 beta program.
nso: Ke swaregile ka lenaneo la Firefox 4 beta.

source: I work on content security policy for Firefox 4.
nso: Ke swaregile ka tšhireletšego ya dikagare tša Firefox 4.

source: We work on crash bugs.
nso: Re šoma ka mathata a go pšhatlega.

source: I'm David and I work on developer tools for Firefox 4, and I'd really like to know what you think.
nso: Ke nna David gomme ke šoma ka dithulusi tša batšweletši tša Firefox 4, gomme nka rata go tseba gore o nagana eng.

source: We need as much feedback as possible.
nso: Re hloka karabelo e ntšhi ka mo go ka kgonegago.

source: I work on the Firefox 4 Sync servers.
nso: Ke šoma go diabi tša Firefox 4 Sync.

source: Firefox Sync lets you take your Firefox experience with you wherever you go.
nso: Firefox Sync e go dumelela go ya kae le kae le maitemogelo a gago a Firefox.

source: And we're really looking forward to your feedback.
nso: Gomme re tloga re fagahletše karabelo ya gago.

source: I work on JetPack, which is a project to make it easier to build Add-Ons and to make Add-Ons easier to use.
nso: Ke šoma ka JetPack, yeo e lego projeke yeo e dirago gore go be bonolo go aga Ditlaleletši le go dira gore go be bonolo go diriša Ditlaleletši.

source: i worked on the new Add-ons manager in Firefox 4.
nso: Ke šomile go molaodi o moswa wa Ditlaleletši go Firefox 4.

source: We'd really like to know your feedback about what you love and hate about Firefox 4, so let us know.
nso: Re tloga re nyaka go tseba karabelo ya gago ka ga seo o se ratago le seo o se hloilego ka Firefox 4, ka gona re tsebiše.

source: Please help us and make Firefox better!
nso: Hle re thuše gomme re dire gore Firefox e be e kaonekaone!

source: We need your feedback.
nso: Re hloka karabelo ya gago.
