Repository: translate/mozilla-com
Catalog: ach/firefox/channel/index.html.po
Languages: lg

source: Firefox Future Releases
lg: Kelo woko Firefox ikare me anyim

source: Coming Soon!
lg: Bino I kare macokcoki!

source: Get notified when Beta is ready.
lg: Nwong ngec ka Beta dong tye atera.

source: Get the latest <span>channel news</span> in English
lg: Nwong ma okati cokcoki <span> cwal lamut</span> i leb Munu

source: Sign up for one or all of our Firefox channel newsletters.
lg: Coye pi acel onyo gin weng pi cwalo waraga pi lamut me Firefox wa.

source: Thanks for subscribing!
lg: Opwoyo coye!

source: Your email address
lg: Email address mamegi

source: Whoops! Be sure to enter a valid email address.
lg: Whoops! Nen ni myero iket email address matiyo.

source: Select country
lg: Yes lobo

source: General Mozilla News
lg: Lamut me Mozilla Alutu

source: Please select at least one newsletter.
lg: Tim ber

source: Sign me up!
lg: Mia acoye!

source: We will only send you Mozilla-related information (<a href="/privacy-policy">Mozilla Privacy Policy</a>).
lg: Wan obi cwali ngec marwate ki Mozilla keken (<a href="/privacy-policy">Cik pa dano me Mozilla</a>).

source: firefox-channels
lg: cwalo firefox
